translit_map_ru_to_en = { 'а': 'a', 'б': 'b', 'в': 'v', 'г': 'g', 'д': 'd',
                         'е': 'e', 'ё': 'yo', 'ж': 'zh', 'з': 'z', 'и': 'i',
                         'й': 'y', 'к': 'k', 'л': 'l', 'м': 'm', 'н': 'n',
                         'о': 'o', 'п': 'p', 'р': 'r', 'с': 's', 'т': 't',
                         'у': 'u', 'ф': 'f', 'х': 'kh', 'ц': 'ts', 'ч': 'ch',
                         'ш': 'sh', 'щ': 'shch', 'ъ': "'", 'ы': 'y', 'ь': "'",
                         'э': 'e', 'ю': 'yu', 'я': 'ya', 'А': 'A', 'Б': 'B', 'В':
                         'V', 'Г': 'G', 'Д': 'D', 'Е': 'E', 'Ё': 'Yo', 'Ж': 'Zh',
                         'З': 'Z', 'И': 'I', 'Й': 'Y', 'К': 'K', 'Л': 'L', 'М': 'M',
                         'Н': 'N', 'О': 'O', 'П': 'P', 'Р': 'R', 'С': 'S', 'Т': 'T',
                         'У': 'U', 'Ф': 'F', 'Х': 'Kh', 'Ц': 'Ts', 'Ч': 'Ch', 'Ш': 'Sh',
                         'Щ': 'Shch', 'Ъ': "'", 'Ы': 'Y', 'Ь': "'", 'Э': 'E', 'Ю': 'Yu',
                         'Я': 'Ya' }

translit_map_en_to_ru = {'shch': 'щ', 'Shch': 'Щ', 'yo': 'ё', 'zh': 'ж', 'kh': 'х', 'ts': 'ц', 
                         'ch': 'ч', 'sh': 'ш', 'yu': 'ю', 'ya': 'я', 'Yo': 'Ё', 'Zh': 'Ж', 'Kh': 'Х', 
                         'Ts': 'Ц', 'Ch': 'Ч', 'Sh': 'Ш', 'Yu': 'Ю', 'Ya': 'Я', 'a': 'а', 'b': 'б', 
                         'v': 'в', 'g': 'г', 'd': 'д', 'e': 'э', 'z': 'з', 'i': 'и', 'y': 'ы', 'k': 'к', 
                         'l': 'л', 'm': 'м', 'n': 'н', 'o': 'о', 'p': 'п', 'r': 'р', 's': 'с', 't': 'т', 
                         'u': 'у', 'f': 'ф', "'": 'Ь', 'A': 'А', 'B': 'Б', 'V': 'В', 'G': 'Г', 'D': 'Д', 
                         'E': 'Э', 'Z': 'З', 'I': 'И', 'Y': 'Ы', 'K': 'К', 'L': 'Л', 'M': 'М', 'N': 'Н', 'O': 'О', 
                         'P': 'П', 'R': 'Р', 'S': 'С', 'T': 'Т', 'U': 'У', 'F': 'Ф'}

eng_txt = 'shch zh Ya Shch Yu yo ShchShchYuF'
ru_txt = eng_txt

for k,v in translit_map_en_to_ru.items():
    ru_txt = ru_txt.replace(k,v)

print(ru_txt)
eng_txt = ru_txt

for k, v in translit_map_ru_to_en.items():
    eng_txt = eng_txt.replace(k,v)

print(eng_txt)